# Brewfile for Luis Medina's setup

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# CLI tools
brew "awk"           # Text processing
brew "curl"
brew "wget"
brew "git"
brew "zsh"
brew "fd"           # Alternative to find
brew "fzf"
brew "bat"          # Cat with syntax highlighting
brew "neovim"
brew "ripgrep"      # Search tool
brew "tree"
brew "eza"
brew "jq"
brew "yadm"         # For dotfile management

brew "spaceman"
# brew "Hidden Bar" # Hide menu bar icons
# brew "broot"      # Navigate directories, find files, and launch commands.

# brew "pandoc" # Convert files from one format to another.
# brew "taskwarrior-tui" # ToDo Tool for CLI 
# brew "ncdu" # Disk usage analyzer

brew "zsh-syntax-highlighting" 
brew "zsh-completions"          
brew "zsh-autosuggestions"      

# Development tools
brew "pyenv"        # Python version management
brew "jenv"         # Java version management

# Applications
cask "visual-studio-code"
cask "google-chrome" # Browser
cask "iterm2"
cask "homerow"

# cask "docker"
# cask "rancher"      # Kubernetes management
