# Brewfile for Luis Medina's setup

# CLI tools
brew "curl"
brew "wget"
brew "git"
brew "zsh"
brew "fd"           # Alternative to find
brew "fzf"
brew "bat"          # Cat with syntax highlighting
brew "neovim"
brew "ripgrep"      # Search tool
brew "tree"
brew "eza"          # Modern ls replacement
brew "jq"
brew "chezmoi"      # Dotfile management
brew "zoxide"       # Smarter cd
brew "gh"           # GitHub CLI
brew "tmux"         # Terminal multiplexer
brew "mackup"       # App settings backup
brew "kanata"       # Keyboard remapping daemon

cask "spaceman"     # Show spaces in menu bar

# ZSH plugins are managed by Zinit (plugins/init.zsh) — no Homebrew packages needed

# Development tools
brew "pipx"         # Install Python CLI tools in isolated envs

# Applications
cask "visual-studio-code"
cask "google-chrome"
cask "iterm2"
cask "homerow"
cask "karabiner-elements"
cask "bettertouchtool"
cask "multitouch"
cask "lunar"