# Brewfile for Luis Medina's setup

# Taps
tap "olets/tap"         # For zsh-abbr

# CLI tools
brew "curl"
brew "wget"
brew "git"
brew "zsh"
brew "fd"           # Alternative to find
brew "fzf"
brew "bat"          # Cat with syntax highlighting
brew "neovim"
brew "ripgrep"      # Search tool
brew "tree"
brew "eza"          # Modern ls replacement
brew "jq"
brew "yadm"         # Dotfile management
brew "zoxide"       # Smarter cd
brew "gh"           # GitHub CLI
brew "tmux"         # Terminal multiplexer
brew "mackup"       # App settings backup

cask "spaceman"     # Show spaces in menu bar

# ZSH plugins (installed via Homebrew)
brew "zsh-syntax-highlighting"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "olets/tap/zsh-abbr"  # Auto-expanding abbreviations (moved to olets/tap)

# Development tools
brew "pyenv"        # Python version management
brew "jenv"         # Java version management

# Applications
cask "visual-studio-code"
cask "google-chrome"
cask "iterm2"
cask "homerow"
cask "karabiner-elements"
cask "bettertouchtool"
